{"basics":{"name":"Dhruv Sharma","label":"Machine Learning & Full Stack Developer","email":"dhruvviveksharma@gmail.com","phone":"(747) 299-1767","url":"https://www.linkedin.com/in/dhruv-sharma-736668223/","summary":"Motivated and results-driven Computer Engineering student with a strong foundation in machine learning, full-stack development, and research leadership. Passionate about building impactful AI solutions, from healthcare applications to intelligent agent systems. Outside of the lab, I bring the same discipline and focus to fitness—whether it’s weightlifting at the gym, competing in racquet sports, or cycling long distances. I thrive on challenges, both intellectual and physical, and bring energy, creativity, and resilience to everything I do.","location":{"city":"San Diego","region":"California","countryCode":"US"},"profiles":[{"network":"LinkedIn","username":"dhruv-sharma-736668223","url":"https://www.linkedin.com/in/dhruv-sharma-736668223/"},{"network":"GitHub","username":"dhruvviveksharma","url":"https://github.com/dhruvviveksharma"}]},"education":[{"institution":"University of California, San Diego","area":"Computer Engineering","studyType":"Bachelor of Science","startDate":"2023-09-01","endDate":"2027-06-01","gpa":"3.88","courses":["Data Structures and Algorithms","Object-Oriented Programming","Probability and Statistics","Distributed Systems","Machine Learning","Software Engineering"],"honors":["Provost Honors"]}],"work":[{"name":"Q-Lab","location":"San Diego, United States","position":"Graphics and LLM Research Intern","startDate":"2025-02-01","summary":"Developing simulation frameworks using Vision and Language Models for dynamic world building and autonomous agent training.","highlights":["Built a simulation framework powered by Large Language Models (LLMs) to generate dynamic, interactive virtual worlds, enabling real-time collaboration between autonomous agents.","Engineered 200+ lifelike character animations in Unreal Engine 5.3, improving realism and social interaction fidelity in Large World Models .","Trained over 50 context-aware autonomous agents by combining reinforcement learning with chain-of-thought reasoning, significantly improving their ability to interpret natural language prompts and respond to environmental cues.","Paper under review for top-tier conference"]},{"name":"Knight Lab","location":"San Diego, United States","position":"Machine Learning Research Intern","startDate":"2024-10-01","summary":"Applied deep learning, CI/CD engineering, and software architecture to accelerate microbial genomics research through scalable ML pipelines.","highlights":["Developed and trained deep learning models using TensorFlow to analyze 16S rRNA genomic data, increasing species identification accuracy from 65% to over 90%.","Engineered a robust CI/CD pipeline for model development and deployment using Docker, Kubernetes, and Git, enabling automated testing and faster iteration.","Streamlined the machine learning workflow by implementing object-oriented design patterns (Singleton, Decorator), reducing pipeline complexity and cutting development time by 20%.","Built a failure-tolerant training pipeline in Python on Ubuntu, integrating automated testing and anomaly detection to ensure model reliability and scalability."]},{"name":"UC San Diego","location":"San Diego, United States","position":"Orientation Leader","startDate":"2024-04-01","endDate":"2024-12-01","summary":"Guided incoming students through their first quarter at UCSD, providing academic and social support.","highlights":["Guided 60+ incoming freshmen through their transition to college life by fostering a welcoming and inclusive environment.","Facilitated group activities, encouraged participation, and mediated interpersonal dynamics to ensure a positive orientation experience.","Provided personalized support to students by addressing academic and logistical concerns, including course enrollment guidance and resource referrals.","Developed leadership, communication, and conflict-resolution skills by managing both group dynamics and individual needs.","Successfully created a foundation for new students to navigate university life with confidence and a sense of belonging."]},{"name":"Consat Orahi","location":"Gurgaon, India","position":"Data Analyst Intern","startDate":"2023-06-01","endDate":"2023-08-31","summary":"Leveraged data analytics and visualization tools to uncover workforce trends and support decision-making in employee management.","highlights":["Collected and processed access card data using Python and Pandas to analyze employee attendance patterns.","Built an interactive Tableau dashboard visualizing trends across 3 fiscal quarters, enabling management to identify attendance irregularities and workflow patterns.","Presented data-driven insights and proposed actionable strategies to leadership, contributing to improved workforce management and resource allocation."]},{"name":"G-Square Solutions","location":"Mumbai, India","position":"Data Analyst Intern","startDate":"2022-06-01","endDate":"2022-09-30","summary":"Built predictive machine learning models to forecast buyer interest in real estate markets using large-scale interaction data.","highlights":["Designed a machine learning pipeline using scikit-learn to predict property buyer interest across major Indian real estate markets.","Engineered and cleaned a training dataset of 700,000+ customer-broker interactions using Pandas and Seaborn, ensuring high-quality input for model training.","Achieved 94.5% classification accuracy using Gradient Boosting and Random Forest, with the model later sold to a real estate company.","Collaborated with cross-functional teams, including sales and data departments, to align deliverables with business objectives."]}],"projects":[{"name":"SimWorld: Open-ended Simulator for Social-Physical Agent Learning","url":"https://github.com/maitrix-org/SimWorld","startDate":"2025-02-01","endDate":"2025-06-30","summary":"Research project under review involving LLM-enabled agent training in a simulated world."},{"name":"Full Stack RAG Web App","url":"https://github.com/dhruvviveksharma/Full_Stack_AI","startDate":"2024-08-01","summary":"Document-grounded question answering web application using Langchain, FAISS, Ollama, and OpenAI APIs.","highlights":["Built full-stack MERN app with RAG architecture.","Implemented vector embedding search with reranking for enhanced accuracy and to prevent hallucination."]}],"volunteer":[{"organization":"Computer Science and Engineering Society (CSES) Innovate","position":"President & Project Lead","startDate":"2024-10-01","summary":"Leading a student-driven research organization focused on machine learning and social impact projects, including early skin cancer detection through deep learning.","highlights":["President of a 40+ member student research society, overseeing project incubation, cross-disciplinary collaboration, and event organization.","Organized faculty panels and large-scale research events connecting students with academic researchers and industry mentors.","Spearheading a medical AI initiative to develop a CNN-based model for skin lesion classification using dermoscopic imagery and datasets like HAM10000.","Project UI designed with Flutter and Firebase, enabling real-time data collection and model inference on mobile devices.","Designed and implemented preprocessing techniques (normalization, data augmentation) to improve model robustness in detecting melanoma and other lesions.","Also led the development of a transformer-based deep learning model to convert isolated instrument audio into numerical token sequences for sheet music generation."]}],"skills":[{"name":"Programming Languages","keywords":["Python","C++","Java","JavaScript","SQL","Swift","Flutter"]},{"name":"Frameworks & Technologies","keywords":["React","Node.js","MongoDB","Docker","Kubernetes","Linux","Git","Tableau","AWS","Google Analytics"]},{"name":"Concepts","keywords":["Machine Learning","Data Science","Multithreading","Time Series Forecasting","Statistical Modeling","CI/CD","Cloud Integration"]}],"interests":[{"name":"Technology","keywords":["High-performance Computing","Generative AI","Deep Learning","Predictive Modelling","Algorithmic Systems"]},{"name":"Personal","keywords":["Weight Lifting","Tennis","Cycling","Running","Reading","Traveling","Self help"]}]}